lcyyun/ns2pro-bridge/firmware/esp32s3/sdkconfig.defaults
# Base defaults for all ns2pro-bridge ESP32-S3 builds.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Keep the live USB/BLE bridge responsive. Verbose logs are enabled per tag only
# when debugging a specific issue.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_FREERTOS_HZ=1000

# USB device path for the ESP32-S3 native USB peripheral.
CONFIG_TINYUSB_HID_COUNT=2
CONFIG_TINYUSB_VENDOR_COUNT=1
CONFIG_TINYUSB_TASK_STACK_SIZE=16384
CONFIG_TINYUSB_MODE_SLAVE=y
# CONFIG_TINYUSB_MODE_DMA is not set

# BLE central path. This stays ESP-IDF/NimBLE-only and is not shared with the
# Pico SDK / BTstack build.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=20
CONFIG_BT_NIMBLE_TRANSPORT_EVT_SIZE=255
